---
kind: type
id: T:Autodesk.Revit.DB.IFCExportElement
source: html/0d321ff5-0373-81e9-dc0e-a0905a5fae8b.htm
---
# Autodesk.Revit.DB.IFCExportElement

An enumerated type defining if an element is exported to IFC or not.

## Syntax (C#)
```csharp
public enum IFCExportElement
```